mikkelfb/P4_Vertical_farm/RTOS_TEMPLATE-master/PlanteModul.cydsn/Generated_Source/PSoC5/DS18x8_ControlReg_DRV.h
/*******************************************************************************
* File Name: DS18x8_ControlReg_DRV.h  
* Version 1.80
*
* Description:
*  This file containts Control Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_CONTROL_REG_DS18x8_ControlReg_DRV_H) /* CY_CONTROL_REG_DS18x8_ControlReg_DRV_H */
#define CY_CONTROL_REG_DS18x8_ControlReg_DRV_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 controlState;

} DS18x8_ControlReg_DRV_BACKUP_STRUCT;


/***************************************
*         Function Prototypes 
***************************************/

void    DS18x8_ControlReg_DRV_Write(uint8 control) ;
uint8   DS18x8_ControlReg_DRV_Read(void) ;

void DS18x8_ControlReg_DRV_SaveConfig(void) ;
void DS18x8_ControlReg_DRV_RestoreConfig(void) ;
void DS18x8_ControlReg_DRV_Sleep(void) ; 
void DS18x8_ControlReg_DRV_Wakeup(void) ;


/***************************************
*            Registers        
***************************************/

/* Control Register */
#define DS18x8_ControlReg_DRV_Control        (* (reg8 *) DS18x8_ControlReg_DRV_Sync_ctrl_reg__CONTROL_REG )
#define DS18x8_ControlReg_DRV_Control_PTR    (  (reg8 *) DS18x8_ControlReg_DRV_Sync_ctrl_reg__CONTROL_REG )

#endif /* End CY_CONTROL_REG_DS18x8_ControlReg_DRV_H */


/* [] END OF FILE */
